{
	"andrianampoinimerina": {
		"birth": "1745 - 1810",
		"regne": "1787 - 1840",
		"descrit": "Andrianampoinimerina fut le célèbre roi de l’Imerina qui, né vers 1745, régna de 1787 à 1810. Ayant débuté comme souverain du petit royaume d’Ambohimanga, au Nord-est d’Antananarivo, il conquit les royaumes hova voisins et soumit les Bétsileo, aux confins Sud, et les Sihanaka, à l’Est, sans pouvoir vaincre les Sakalava de l’Ouest. Considéré comme le plus sage roi de Madagascar, il visait à unifier l’Ile et prononça la célèbre maxime « Ny ranomasina no valam-parihiko » ou « La mer est la limite de ma rizière ». Durant ses campagnes de conquête, il privilégiait toujours la démarche pacifique, et ne recourait aux armes qu’après avoir épuisé toutes les négociations possibles, et c’est ainsi qu’il avait pu conquérir les royaumes d’Antananarivo, d’Imerinkasinina, d’Ambatomanga, de Marovatana, de Vonizongo, de l’Imamo, du Vakinankaratra et du Betsileo. Organisateur-né, il sut structurer son royaume en six provinces ou « Imerina enin-toko », qui furent : Avaradrano, Ambodirano, Marovatana, Vonizongo, Vakinisisaony et Vakinankaratra. Il organisa le royaume en « fokonolona », structures de base, pour partager son pouvoir avec le peuple, et institua les Vadintany ou inspecteurs royaux. Andrianampoinimerina promulgua les douze crimes passibles de la peine de mort. Privilégiant l’agriculture pour prévenir la famine, il mit en œuvre des grands travaux d’aménagement de la plaine du Betsimitatatra et la construction de digues. Il priorisa aussi l’institution de marchés ou « tsena », et uniformisa les unités de mesure."
	},
	"radamaI" : {
		"birth": "1792 - 1828",
		"regne" : "1810 - 1828",
		"descrit" : "Laidama ou Radama Ier succéda à son père Andrianampoinimerina et se fit sacrer à Andohalo comme roi de l’Imerina. Il régna entre 1810 et 1828 et s’installa définitivement à Antananarivo, la future capitale de Madagascar, qu’il prit aussi comme capitale de son royaume. Contrairement à son père qui avait interdit l’accès du pays aux étrangers, Radama I entretint des relations privilégiées avec les Britanniques en signant un traité d’amitié avec la Couronne d’Angleterre le 23 octobre 1817. Durant son règne, de nombreux missionnaires britanniques furent envoyés à Madagascar par la London Missionary Society ou LMS, parmi lesquels David Jones et Thomas Bevan, dès 1818. Madagascar sut profiter des relations privilégiées avec l’Angleterre et se fit aussi envoyer, outre les missionnaires, des artisans et des enseignants, ce qui contribua à l’essor de l’enseignement dans le royaume, dont la première école fut inaugurée à Anatirova (la cour royale) le 8 décembre 1820 par Radama en personne et le missionnaire Jones. Si bien qu’à la mort du souverain en 1828, il y avait une centaine d’écoles et 4 000 élèves en Imerina, et entre 1820 et 1835, les personnes scolarisées se comptaient entre 10 000 et 15 000. Dès 1822, des vagues successives de missionnaires-techniciens affluèrent avec du matériel et des outils, qui formèrent les jeunes malgaches aux différents métiers tels le travail du bois, la forge, la filature et le tissage, le tannage, les poteries, la fabrication de savon et de bougies… bref, pour apprendre aux natifs toutes les techniques européennes … En outre, le commerce avec les Européens ne cessa de se développer durant le bon règne de Radama I.Parallèlement, les mœurs de la population s’adoucirent grâce au christianisme, et le roi abolit l’épreuve du Tangena (épreuve de vérité qui consistait à faire boire du poison à l’inculpé pour confirmer ou infirmer sa culpabilité). Radama supprima aussi la traite des esclaves. Pour moderniser son armée et la calquer sur le modèle européen, le roi créa une armée régulière dotée d’armes à feu fournies par Londres et formée par des instructeurs britanniques."
	},
	"ranavalonaI" : {
		"birth" : "1780 - 1861",
		"regne" : "1828 - 1861",
		"descrit" : "Ranavalona Ière, successeur de son époux Radama I, était une souveraine autoritaire et nationaliste. Elle a régné sur l’Imerina (Antananarivo actuel) entre 1828 et 1861. Contrairement à son époux, elle s’attacha aux valeurs traditionnelles comme la croyance aux « Sampy » ou idoles ancestrales, et rétablit la pratique du tangena ou Fampinomana (épreuve de vérité en faisant ingurgiter une certaine dose de poison à l’inculpé pour confirmer ou infirmer sa culpabilité). À partir de 1835, elle persécuta ses sujets qui avaient embrassé la religion chrétienne apportée par les missionnaires anglais dès 1820, puis elle chassa ces missionnaires mêmes. Ces actes étaient dictés par sa crainte de l’influence européenne sur son royaume et de l’expansion des étrangers. En outre, la traite des esclaves déjà bannie lors du règne de Radama I, fut rétablie. Entre 1845 et 1853, elle rompit totalement les relations commerciales de son pays avec l’extérieur, telles celles avec l’Ile Maurice et La Réunion. En 1853, le commerce reprit, mais dans le seul intérêt des Malgaches. En 1857, quatre ans avant sa mort, tous les étrangers dans le territoire malgache furent expulsés, car soupçonnés d’avoir pris part à un complot qui aurait visé la Reine Ranavalona Ière."
	},
	"radamaII" : {
		"birth" : "1829 - 1863",
		"regne" : "1861 - 1863",
		"descrit" : "À la mort de Ranavalona I, son fils naturel, le prince Rakoto qui devint Radama II en régnant, lui succéda et fut intronisé à Mahamasina, Antananarivo. Ce roi n’a régné que 2 ans (de 1861 à 1863) et le peuple l’affubla du sobriquet de « Radama nanjaka tapany » ou « Radama au court règne ». À l’opposé de sa mère, il ouvrit les portes du royaume aux étrangers. Missionnaires protestants et catholiques rivalisèrent d’activités. Le 12 septembre 1862, un traité avec la France fut signé. Roi très libéral, Radama II supprima les corvées et abolit la peine de mort. Il rétablit la liberté des mœurs et de religion.  Le christianisme fut de nouveau pratiqué en toute liberté comme du temps de Radama I. Par contre, l’administration se relâcha de plus en plus. La population était en colère devant les frasques du roi et de ses amis les « Menamaso », accusés avec lui de débordements. La « Charte Lambert » qui permit aux Français d’avoir de vastes concessions à Madagascar fut à l’origine d’une rupture totale entre le roi et les hauts dignitaires du royaume (le clan dit des « Andafiavaratra »). Le Premier ministre Rainivoninahitriniony, membre dudit clan, fit massacrer les « Menamaso » les 7 et 8 mai 1863. Le Roi Radama II fut assassiné dans son palais le 11 mai 1863. Il avait 33 ans."
	},
	"rasoherina" : {
		"birth" : "1818 - 1868",
		"regne" : "1863 - 1868",
		"descrit" : "Après la mort tragique du roi Radama II, son épouse Rasoherina lui succéda au pouvoir. Couronnée le 13 mai 1863, elle devenait 5ème monarque de Madagascar et régna 1863 à 1868. En matière de politique intérieure, elle fit montre de prudence dans la direction des affaires du royaume. Tout en rompant avec la politique de fermeture de sa belle-mère Ranavalona I, elle fit cesser aussi le laxisme et le relâchement des mœurs de son défunt mari Radama II. Autrement dit, elle maintint l’ouverture de son pays aux étrangers tout en leur interdisant l’accès d’Ambohimanga, le berceau de la royauté merina. Cependant, la reine remit en cause la « Charte Lambert » et récusa le traité Franco-malgache du 12 septembre 1862. Elle respecta aussi la liberté religieuse, mais ne permit aucune interférence entre les affaires du royaume et celles de la religion. Le Premier ministre Rainivoninahitriniony ayant été remplacé par son frère cadet Rainilaiarivony en 1864, ce dernier épousa la reine et s’accapara la totalité du pouvoir, devenant durant le règne de Rasoherina le vrai dirigeant de Madagascar. Le 27 juin 1865, un nouveau traité avec l’Empire britannique fut signé, de même qu’un traité avec les États-Unis, signé le 14 février 1867."
	},
	"ranavalonaII" : {
		"birth" : "1829 - 1883",
		"regne" : "1868 - 1883",
		"descrit" : "Ranavalona II, cousine de Rasoherina, couronnée le 3 septembre 1868, fut épousée par le Premier ministre Rainilaiarivony. Son règne qui dura 15 ans (de 1868 à 1883), fut marqué par le retour de la religion chrétienne. En fait, Ranavalona II prit le protestantisme comme religion d’état et se fit baptiser au « Tranovola ». Elle fit brûler tous les « sampy » ou idoles royales. C’est elle qui fit bâtir le Temple d’Anatirova dans l’enceinte du palais royal de Manjakamiadana, Antananarivo. Différentes réformes virent le jour durant son règne, telles que la limitation du nombre des aides de camp des hauts gradés de l’armée royale, l’institution obligatoire d’un service militaire de 5 ans en 1877, la mise en place des « Sakaizam-bohitra » en 1878, l’élaboration de différents codes, l’institution des « Valo toko » ou huit ministres, et l’établissement d’un enseignement obligatoire pour tous les enfants selon le décret royal du 6 juin 1876. Par ailleurs, les relations avec la France allaient de mal en pis. Malgré l’envoi par la reine de différents ambassadeurs pour s’assurer le soutien des États-Unis et d’autres pays européens comme l’Angleterre, l’Allemagne ou l’Italie, contre les visées colonialistes françaises sur sa patrie, la guerre entre les deux pays fut inévitable et éclata en 1883. "
	},
	"ranavalonaIII" : {
		"birth" : "1861 - 1917",
		"regne" : "1883 - 1897",
		"descrit" : "Ranavalona III fut la dernière reine de Madagascar. Elle régna entre 1883 et 1897 sous l’influence de son époux et à la fois Premier ministre Rainilaiarivony. La guerre franco-malgache qui avait duré deux ans (de 1883 à 1885) commença d’épuiser le royaume. Le Premier ministre, craignant les conséquences d’une longue guerre, demanda la fin des hostilités et signa avec la France le traité du 17 décembre 1885. Ledit traité accorda à la France beaucoup d’avantages, tels la conduite par la France de la politique étrangère de Madagascar par le biais de son Résident général à Antananarivo, ainsi que l’installation des Français à Diégo Suarez, l’occupation de Toamasina, le contrôle et la perception par les Français des droits de douane malgaches jusqu’au paiement à la France par le Gouvernement de Madagascar d’une somme de 10 millions de francs. L’armée malgache devenait de plus en plus faible et le dernier royaume de Madagascar s’engagea davantage vers la perte de sa souveraineté. Une armée d’expédition française de seulement 15 000 hommes vint à bout de la résistance malgache. L’armée malgache capitula le 30 septembre 1895. L’accord de protectorat français fut signé le 1er octobre 1895 et Madagascar fut proclamée officiellement colonie française selon la loi d’annexion du 6 août 1896. La Reine Ranavalona III fut destituée et fut exilée à La Réunion puis à Alger."
	},
	"manjakamiadana" : {
		"nom" : "img/manjakamiadana.jpeg",
		"descrit" : "Le Rova Manjakamiadana, également connu sous le nom de Palais de la Reine à Antananarivo est un site emblématique qui témoigne de l'histoire prestigieuse et tumultueuse de Madagascar. Perché sur la colline d'Analamanga, ce complexe royal impressionne par son architecture traditionnelle malgache, caractérisée par ses imposantes murailles de pierre, ses toits pointus ornés de bois sculpté, et ses vastes salles qui ont été le théâtre des décisions politiques et des événements historiques clés du royaume merina. Entouré de jardins verdoyants et offrant une vue panoramique sur la ville, le Rova Manjakamiadana demeure un symbole vivant de la richesse culturelle et de l'héritage royal de Madagascar, attirant des visiteurs du monde entier pour explorer ses nombreux secrets et récits enchanteurs."
	},
	"baobab" : {
		"nom" : "img/baobab.jpg",
		"descrit" : "L'Allée des Baobabs, située à l'ouest de Madagascar, est une merveille naturelle emblématique qui fascine par ses arbres majestueux et centenaires alignés le long d'une route sablonneuse. Ces baobabs, connus localement sous le nom de 'renala' (arbre de vie), se dressent comme des sentinelles géantes dans un paysage semi-aride, créant une silhouette distincte contre le ciel de Madagascar. <br><br> Ces arbres emblématiques, certains ayant plus de mille ans, sont une source d'inspiration et de mystère pour les visiteurs et les scientifiques, car ils sont adaptés à survivre dans des conditions climatiques difficiles et jouent un rôle vital dans l'écosystème local. L'Allée des Baobabs est non seulement un symbole de la beauté naturelle de Madagascar, mais aussi un lieu chargé d'histoire et de légendes, capturant l'imagination de ceux qui parcourent ses sentiers et admirent ses panoramas spectaculaires au coucher du soleil."
	},
	"bemaraha" : {
		"nom" : "img/bemaraha.png",
		"descrit" : "Le Tsingy de Bemaraha est une merveille naturelle unique au nord-ouest de Madagascar, célèbre pour ses formations karstiques spectaculaires et sa biodiversité exceptionnelle. Classé au patrimoine mondial de l'UNESCO, ce site éblouissant présente un paysage façonné par des millions d'années d'érosion, formant des labyrinthes de pics acérés et des gorges profondes. Ces formations de calcaire, appelées 'tsingy' en malgache, créent un environnement saisissant où une variété d'espèces végétales et animales rares prospèrent, adaptées à ce milieu rocailleux et aride. Pour les aventuriers et les amateurs denature, explorer le Tsingy de Bemaraha offre une expérience inoubliable, entre ascensions vertigineuses, promenades le long de ponts suspendus, et l'immersion dans un écosystème qui conserve un véritable trésor de la biodiversité malgache."
	}
}
